app/views/users/show.html.erb

SELECT  1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? LIMIT 1  [["user_id", 28]]
---
    <div class="col-md-8">
    <% if @user.microposts.any? %>