app/views/shared/_user_info.html.erb

<profile><%= current_user.name %></profile></br>
<profile><%= pluralize(current_user.microposts.count, "Writings") %></profile>
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]