app/controllers/password_resets_controller.rb

  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$V4itFawMB/eXaodZ2Ne.x.8p2kgjEcg7z4UTbJnAWiY/ahsWZl7lW"], ["updated_at", "2015-09-29 19:08:06.400908"], ["id", 101]]